import { HttpClient } from '@angular/common/http';
import { ChangeDetectionStrategy, Component } from '@angular/core';
import { Title } from '@angular/platform-browser';
import { Observable } from 'rxjs';
import { PAGE_TITLES } from 'src/app/constants/constants';
import { Spivrobitniki } from '../../interfaces/spivrobintiki.interface';

@Component({
  selector: 'app-kafedra',
  templateUrl: './kafedra.component.html',
  styleUrls: ['./kafedra.component.scss'],
  changeDetection: ChangeDetectionStrategy.OnPush,
})
export class KafedraComponent {
  constructor(private titleService: Title, private http: HttpClient) {
    this.titleService.setTitle(PAGE_TITLES.KAFEDRA);
  }
  
  kafedra = [
    {
      name: 'Александ Александрович Черно',
      position: 'Завідувач кафедри, доктор технічних наук, доцент.',
      text: 'Народився 21 лютого 1979 р. У 2002 році закінчив УДМТУ ім. адм. Макарова за спеціальністю «Електромеханічні системи автоматизації та електропривод» і отримав диплом магістра з відзнакою. З 2002 по 2005 р.р. навчався в аспірантурі НУК ім. адм. Макарова на кафедрі автоматики. З 1 вересня 2005 р. працює на кафедрі комп’ютеризованих систем управління на посадах асистента (2005 –2007 р.р.), старшого викладача (2007 – 2007 р.р.), доцента (2008 − 2017 р.р.), завідувача кафедри (з. 2018 р.). З листопада 2014 р. виконує обов’язки заступника директора Навчально-наукового інституту автоматики і електротехніки з наукової роботи. У 2007 р. захистив кандидатську, а в 2020 р. − докторську дисертацію. У 2011 р. отримав вчене звання доцента по кафедрі КСУ. Проводить наукові дослідження за напрямом "Синтез електромагнітних вібраційних приводів з мікропроцесорним керуванням". Має 86 публікацій, у тому числі 8 наукових статей у виданнях, включених до наукометричної бази Scopus, патенти на винахід та 2 навчальні посібники. Результати науково-дослідницької діяльності Черно О.О. пройшли апробацію на 33 науково-технічних конференціях, що проводились у різних регіонах України (Миколаїв, Одеса, Львів, Харків, Дніпропетровськ, Кременчук).',
      discipline: '«Елементи і пристрої автоматики та систем управління», «Цифрова обробка сигналів і теорія інформації», «Системи управління маніпуляційних роботів», «Робототехнічні системи в морських технологіях».',
      interest: 'Робототехніка',
      img: 'assets/img/kafedra/1.jpg',
    },
    {
      name: 'Вижол Юрій Олександрович',
      position: 'Доцент кафедри, кандидат фізико – математичних наук',
      text: 'Народився 2 листопада 1954 р. в м. Миколаєві. У 1972 р. закінчив міську школу № 35, а в 1978 р. – Московський фізико-технічний інститут (МФТІ) за спеціальністю «Фізика та механіка хімічних процесів». З 1978 р. по 1981 р. навчався в аспірантурі МФТІ. У травні 1990 р. в Інституті хімічної фізики захистив кандидатську дисертацію. З вересня 2004 р. працює доцентом кафедри комп’ютеризованих систем управління НУК. За результатами наукової роботи опублікував біля 100 наукових праць.',
      discipline: ' «Об’єктно-орієнтовне програмування», «Моделювання об’єктів і систем»',
      interest: 'теплофізика, фізика плазми, автоматизація аналітичних розрахунків, програмування.',
      img: 'assets/img/kafedra/2.jpg',
    },
    {
      name: 'Герасін Олександр Сергійович',
      position: 'Доцент кафедри комп’ютеризованих систем управління, кандидат технічних наук, доцент, лауреат Премії Верховної Ради України молодим вченим',
      text: 'Народився 26 квітня 1991 року в м. Миколаїв. У 1998 році пішов у 1 клас середньої загальноосвітньої школи № 3. Після сьомого класу вступив до Миколаївського морського ліцею ім. М. Александрова. Закінчив його у 2008 році. За успіхи у навчанні нагороджений золотою медаллю. Під час навчання в ліцеї неодноразово брав участь у ліцейських та міських олімпіадах з фізики, хімії, історії. У липні 2008 року вступив до Національного університету кораблебудування (НУК) ім. адм. Макарова. По завершенні навчання у 2014 році отримав диплом магістра з відзнакою. З 2014 по 2017 рр. навчався в аспірантурі НУК ім. адм. Макарова за спеціальністю «Комп’ютерні системи та компоненти» на кафедрі комп’ютеризованих систем управління. З лютого 2015 р. по серпень 2020 працював на посадах від молодшого до старшого наукового співробітника науково-дослідної частини НУК, виконуючи завдання держбюджетних та міжнародних науково-дослідних робіт. З вересня 2015 р. працює на кафедрі комп’ютеризованих систем управління НУК. У 2019 захистив кандидатську дисертацію, у 2023 році отримав вчене звання доцента. У складі авторського колективу отримав Премію Верховної Ради України молодим вченим за 2020 р. Автор понад 60 опублікованих наукових робіт у журналах і працях міжнародних конференцій і, а також 16 патентів на корисну модель. Загальний індекс Хірша за науково-метричною базою (НМБ) SCOPUS складає 9 одиниць, за НМБ Web of Science – 5 одиниць. Здійснює керівництво практикою та випускними кваліфікаційними роботами. У 2021 році під його керівництвом студент групи 5341м Кіліманов Б.О. виконав роботу «Комп’ютеризована система дистанційного керування мобільним роботом, що переміщується по феромагнітній поверхні, на основі технології Інтернету речей» та був відзначений дипломом за II місце у Всеукраїнському конкурсі студентських наукових робіт зі спеціальності «Автоматизація та комп’ютерно-інтегровані технології».      ',
      discipline: '«Інформаційні технології систем управління та захисту інформації», «Комп’ютеризовані системи штучного інтелекту», «Теорія систем та системний аналіз».',
      interest: 'робототехніка, системи автоматичного керування та моніторингу, засоби штучного інтелекту, ідентифікація, Інтернет речей.',
      img: 'assets/img/kafedra/3.jpg',
    },
  ];

  // spivrobitniki$: Observable<Spivrobitniki[]> = new Observable<Spivrobitniki[]>();

  ngOnInit() {
    // this.spivrobitniki$ = this.http
    //   .get<any>('http://lera.diploma/api/employees')
    //   .pipe(map((response) => response.list));
  }
}
